xiao6hu/test01/USB_MIDI_UC_OS2_20191123/2.9.0/CMSIS/Driver/USART_STM32F2xx.h
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2018 Arm Limited
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        12. March
 * $Revision:    V2.6
 *
 * Project:      USART Driver definitions for ST STM32F2xx
 * -------------------------------------------------------------------------- */

#ifndef __USART_STM32F2XX_H
#define __USART_STM32F2XX_H

#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include "Driver_USART.h"
#include "stm32f2xx_hal.h"

#include "RTE_Components.h"
#if   defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
#include "RTE_Device.h"
#elif defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
  #define  VM_ASYNC                      (1UL)
  #define  VM_SYNC                       (2UL)
  #define  VM_IRDA                       (3UL)
  #define  VM_SMARTCARD                  (4UL)
  #define  Asynchronous                  VM_ASYNC
  #define  IrDA                          VM_IRDA
#include "MX_Device.h"
#else
#error "::Device:STM32Cube Framework: not selected in RTE"
#endif

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  #if ((defined(RTE_Drivers_USART1) || \
        defined(RTE_Drivers_USART2) || \
        defined(RTE_Drivers_USART3) || \
        defined(RTE_Drivers_UART4 ) || \
        defined(RTE_Drivers_UART5 ) || \
        defined(RTE_Drivers_USART6))   \
       && (RTE_USART1 == 0)            \
       && (RTE_USART2 == 0)            \
       && (RTE_USART3 == 0)            \
       && (RTE_UART4  == 0)            \
       && (RTE_UART5  == 0)            \
       && (RTE_USART6 == 0))
    #error "USART not configured in RTE_Device.h!"
  #endif

// RTE macros
#define _DMA_CHANNEL_x(x)               DMA_CHANNEL_##x
#define  DMA_CHANNEL_x(x)              _DMA_CHANNEL_x(x)

#define  DMA_PRIORITY(x)              ((x == 0) ? DMA_PRIORITY_LOW    : \
                                       (x == 1) ? DMA_PRIORITY_MEDIUM : \
                                       (x == 2) ? DMA_PRIORITY_HIGH   : \
                                                  DMA_PRIORITY_VERY_HIGH)

#define _DMAx_STREAMy(x, y)             DMA##x##_Stream##y
#define  DMAx_STREAMy(x, y)            _DMAx_STREAMy(x, y)

#define _DMAx_STREAMy_IRQ(x, y)         DMA##x##_Stream##y##_IRQHandler
#define  DMAx_STREAMy_IRQ(x, y)        _DMAx_STREAMy_IRQ(x, y)

#define _DMAx_STREAMy_IRQn(x, y)        DMA##x##_Stream##y##_IRQn
#define  DMAx_STREAMy_IRQn(x, y)       _DMAx_STREAMy_IRQn(x, y)

// USART1 configuration definitions
#if (RTE_USART1 == 1)
  #define MX_USART1

  #if (RTE_USART1_RX_DMA == 1)
    #define MX_USART1_RX_DMA_Instance DMAx_STREAMy(RTE_USART1_RX_DMA_NUMBER, RTE_USART1_RX_DMA_STREAM)
    #define MX_USART1_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART1_RX_DMA_NUMBER, RTE_USART1_RX_DMA_STREAM)
    #define MX_USART1_RX_DMA_Channel  DMA_CHANNEL_x(RTE_USART1_RX_DMA_CHANNEL)
    #define MX_USART1_RX_DMA_Priority DMA_PRIORITY(RTE_USART1_RX_DMA_PRIORITY)

    #define USART1_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART1_RX_DMA_NUMBER, RTE_USART1_RX_DMA_STREAM)
  #endif
  #if (RTE_USART1_TX_DMA == 1)
    #define MX_USART1_TX_DMA_Instance DMAx_STREAMy(RTE_USART1_TX_DMA_NUMBER, RTE_USART1_TX_DMA_STREAM)
    #define MX_USART1_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART1_TX_DMA_NUMBER, RTE_USART1_TX_DMA_STREAM)
    #define MX_USART1_TX_DMA_Channel  DMA_CHANNEL_x(RTE_USART1_TX_DMA_CHANNEL)
    #define MX_USART1_TX_DMA_Priority DMA_PRIORITY(RTE_USART1_TX_DMA_PRIORITY)

    #define USART1_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART1_TX_DMA_NUMBER, RTE_USART1_TX_DMA_STREAM)
  #endif

  #ifndef USART1_GPIO_SPEED_FREQ
    #define USART1_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_USART1_TX == 1)
    #define MX_USART1_TX_Pin        1
    #define MX_USART1_TX_GPIOx      RTE_USART1_TX_PORT
    #define MX_USART1_TX_GPIO_Pin   (1U << RTE_USART1_TX_BIT)
    #define MX_USART1_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART1_TX_GPIO_Speed USART1_GPIO_SPEED_FREQ
    #define MX_USART1_TX_GPIO_AF    GPIO_AF7_USART1
  #endif

  #if (RTE_USART1_RX == 1)
    #define MX_USART1_RX_Pin        1
    #define MX_USART1_RX_GPIOx      RTE_USART1_RX_PORT
    #define MX_USART1_RX_GPIO_Pin   (1U << RTE_USART1_RX_BIT)
    #define MX_USART1_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART1_RX_GPIO_Speed USART1_GPIO_SPEED_FREQ
    #define MX_USART1_RX_GPIO_AF    GPIO_AF7_USART1
  #endif

  #if (RTE_USART1_CK == 1)
    #define MX_USART1_CK_Pin        1
    #define MX_USART1_CK_GPIOx      RTE_USART1_CK_PORT
    #define MX_USART1_CK_GPIO_Pin   (1U << RTE_USART1_CK_BIT)
    #define MX_USART1_CK_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART1_CK_GPIO_Speed USART1_GPIO_SPEED_FREQ
    #define MX_USART1_CK_GPIO_AF    GPIO_AF7_USART1
  #endif


  #if (RTE_USART1_RTS == 1)
    #define MX_USART1_RTS_Pin        1
    #define MX_USART1_RTS_GPIOx      RTE_USART1_RTS_PORT
    #define MX_USART1_RTS_GPIO_Pin   (1U << RTE_USART1_RTS_BIT)
    #define MX_USART1_RTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART1_RTS_GPIO_Speed USART1_GPIO_SPEED_FREQ
    #define MX_USART1_RTS_GPIO_AF    GPIO_AF7_USART1
  #endif

  #if (RTE_USART1_CTS == 1)
    #define MX_USART1_CTS_Pin        1
    #define MX_USART1_CTS_GPIOx      RTE_USART1_CTS_PORT
    #define MX_USART1_CTS_GPIO_Pin   (1U << RTE_USART1_CTS_BIT)
    #define MX_USART1_CTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART1_CTS_GPIO_Speed USART1_GPIO_SPEED_FREQ
    #define MX_USART1_CTS_GPIO_AF    GPIO_AF7_USART1
  #endif
#endif

