xiao6hu/test01/USB_MIDI_UC_OS2_20191123/2.9.0/CMSIS/Driver/USART_STM32F2xx.h
// USART2 configuration definitions
#if (RTE_USART2 == 1)
  #define MX_USART2

  #if (RTE_USART2_RX_DMA == 1)
    #define MX_USART2_RX_DMA_Instance DMAx_STREAMy(RTE_USART2_RX_DMA_NUMBER, RTE_USART2_RX_DMA_STREAM)
    #define MX_USART2_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART2_RX_DMA_NUMBER, RTE_USART2_RX_DMA_STREAM)
    #define MX_USART2_RX_DMA_Channel  DMA_CHANNEL_x(RTE_USART2_RX_DMA_CHANNEL)
    #define MX_USART2_RX_DMA_Priority DMA_PRIORITY(RTE_USART2_RX_DMA_PRIORITY)

    #define USART2_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART2_RX_DMA_NUMBER, RTE_USART2_RX_DMA_STREAM)
  #endif
  #if (RTE_USART2_TX_DMA == 1)
    #define MX_USART2_TX_DMA_Instance DMAx_STREAMy(RTE_USART2_TX_DMA_NUMBER, RTE_USART2_TX_DMA_STREAM)
    #define MX_USART2_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART2_TX_DMA_NUMBER, RTE_USART2_TX_DMA_STREAM)
    #define MX_USART2_TX_DMA_Channel  DMA_CHANNEL_x(RTE_USART2_TX_DMA_CHANNEL)
    #define MX_USART2_TX_DMA_Priority DMA_PRIORITY(RTE_USART2_TX_DMA_PRIORITY)

    #define USART2_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART2_TX_DMA_NUMBER, RTE_USART2_TX_DMA_STREAM)
  #endif

  #ifndef USART2_GPIO_SPEED_FREQ
    #define USART2_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_USART2_TX == 1)
    #define MX_USART2_TX_Pin        1
    #define MX_USART2_TX_GPIOx      RTE_USART2_TX_PORT
    #define MX_USART2_TX_GPIO_Pin   (1U << RTE_USART2_TX_BIT)
    #define MX_USART2_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART2_TX_GPIO_Speed USART2_GPIO_SPEED_FREQ
    #define MX_USART2_TX_GPIO_AF    GPIO_AF7_USART2
  #endif

  #if (RTE_USART2_RX == 1)
    #define MX_USART2_RX_Pin        1
    #define MX_USART2_RX_GPIOx      RTE_USART2_RX_PORT
    #define MX_USART2_RX_GPIO_Pin   (1U << RTE_USART2_RX_BIT)
    #define MX_USART2_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART2_RX_GPIO_Speed USART2_GPIO_SPEED_FREQ
    #define MX_USART2_RX_GPIO_AF    GPIO_AF7_USART2
  #endif

  #if (RTE_USART2_CK == 1)
    #define MX_USART2_CK_Pin        1
    #define MX_USART2_CK_GPIOx      RTE_USART2_CK_PORT
    #define MX_USART2_CK_GPIO_Pin   (1U << RTE_USART2_CK_BIT)
    #define MX_USART2_CK_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART2_CK_GPIO_Speed USART2_GPIO_SPEED_FREQ
    #define MX_USART2_CK_GPIO_AF    GPIO_AF7_USART2
  #endif


  #if (RTE_USART2_RTS == 1)
    #define MX_USART2_RTS_Pin        1
    #define MX_USART2_RTS_GPIOx      RTE_USART2_RTS_PORT
    #define MX_USART2_RTS_GPIO_Pin   (1U << RTE_USART2_RTS_BIT)
    #define MX_USART2_RTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART2_RTS_GPIO_Speed USART2_GPIO_SPEED_FREQ
    #define MX_USART2_RTS_GPIO_AF    GPIO_AF7_USART2
  #endif

  #if (RTE_USART2_CTS == 1)
    #define MX_USART2_CTS_Pin        1
    #define MX_USART2_CTS_GPIOx      RTE_USART2_CTS_PORT
    #define MX_USART2_CTS_GPIO_Pin   (1U << RTE_USART2_CTS_BIT)
    #define MX_USART2_CTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART2_CTS_GPIO_Speed USART2_GPIO_SPEED_FREQ
    #define MX_USART2_CTS_GPIO_AF    GPIO_AF7_USART2
  #endif
#endif

// USART3 configuration definitions
#if (RTE_USART3 == 1)

  #ifndef USART3
    #error "USART3 not available for selected device!"
  #endif

  #define MX_USART3

  #if (RTE_USART3_RX_DMA == 1)
    #define MX_USART3_RX_DMA_Instance DMAx_STREAMy(RTE_USART3_RX_DMA_NUMBER, RTE_USART3_RX_DMA_STREAM)
    #define MX_USART3_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART3_RX_DMA_NUMBER, RTE_USART3_RX_DMA_STREAM)
    #define MX_USART3_RX_DMA_Channel  DMA_CHANNEL_x(RTE_USART3_RX_DMA_CHANNEL)
    #define MX_USART3_RX_DMA_Priority DMA_PRIORITY(RTE_USART3_RX_DMA_PRIORITY)

    #define USART3_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART3_RX_DMA_NUMBER, RTE_USART3_RX_DMA_STREAM)
  #endif
  #if (RTE_USART3_TX_DMA == 1)
    #define MX_USART3_TX_DMA_Instance DMAx_STREAMy(RTE_USART3_TX_DMA_NUMBER, RTE_USART3_TX_DMA_STREAM)
    #define MX_USART3_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART3_TX_DMA_NUMBER, RTE_USART3_TX_DMA_STREAM)
    #define MX_USART3_TX_DMA_Channel  DMA_CHANNEL_x(RTE_USART3_TX_DMA_CHANNEL)
    #define MX_USART3_TX_DMA_Priority DMA_PRIORITY(RTE_USART3_TX_DMA_PRIORITY)

    #define USART3_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART3_TX_DMA_NUMBER, RTE_USART3_TX_DMA_STREAM)
  #endif

  #ifndef USART3_GPIO_SPEED_FREQ
    #define USART3_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_USART3_TX == 1)
    #define MX_USART3_TX_Pin        1
    #define MX_USART3_TX_GPIOx      RTE_USART3_TX_PORT
    #define MX_USART3_TX_GPIO_Pin   (1U << RTE_USART3_TX_BIT)
    #define MX_USART3_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART3_TX_GPIO_Speed USART3_GPIO_SPEED_FREQ
    #define MX_USART3_TX_GPIO_AF    GPIO_AF7_USART3
  #endif

  #if (RTE_USART3_RX == 1)
    #define MX_USART3_RX_Pin        1
    #define MX_USART3_RX_GPIOx      RTE_USART3_RX_PORT
    #define MX_USART3_RX_GPIO_Pin   (1U << RTE_USART3_RX_BIT)
    #define MX_USART3_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART3_RX_GPIO_Speed USART3_GPIO_SPEED_FREQ
    #define MX_USART3_RX_GPIO_AF    GPIO_AF7_USART3
  #endif

  #if (RTE_USART3_CK == 1)
    #define MX_USART3_CK_Pin        1
    #define MX_USART3_CK_GPIOx      RTE_USART3_CK_PORT
    #define MX_USART3_CK_GPIO_Pin   (1U << RTE_USART3_CK_BIT)
    #define MX_USART3_CK_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART3_CK_GPIO_Speed USART3_GPIO_SPEED_FREQ
    #define MX_USART3_CK_GPIO_AF    GPIO_AF7_USART3
  #endif


  #if (RTE_USART3_RTS == 1)
    #define MX_USART3_RTS_Pin        1
    #define MX_USART3_RTS_GPIOx      RTE_USART3_RTS_PORT
    #define MX_USART3_RTS_GPIO_Pin   (1U << RTE_USART3_RTS_BIT)
    #define MX_USART3_RTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART3_RTS_GPIO_Speed USART3_GPIO_SPEED_FREQ
    #define MX_USART3_RTS_GPIO_AF    GPIO_AF7_USART3
  #endif

  #if (RTE_USART3_CTS == 1)
    #define MX_USART3_CTS_Pin        1
    #define MX_USART3_CTS_GPIOx      RTE_USART3_CTS_PORT
    #define MX_USART3_CTS_GPIO_Pin   (1U << RTE_USART3_CTS_BIT)
    #define MX_USART3_CTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART3_CTS_GPIO_Speed USART3_GPIO_SPEED_FREQ
    #define MX_USART3_CTS_GPIO_AF    GPIO_AF7_USART3
  #endif
#endif

// UART4 configuration definitions
#if (RTE_UART4 == 1)

  #ifndef UART4
    #error "UART4 not available for selected device!"
  #endif

  #define MX_UART4

  #if (RTE_UART4_RX_DMA == 1)
    #define MX_UART4_RX_DMA_Instance DMAx_STREAMy(RTE_UART4_RX_DMA_NUMBER, RTE_UART4_RX_DMA_STREAM)
    #define MX_UART4_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART4_RX_DMA_NUMBER, RTE_UART4_RX_DMA_STREAM)
    #define MX_UART4_RX_DMA_Channel  DMA_CHANNEL_x(RTE_UART4_RX_DMA_CHANNEL)
    #define MX_UART4_RX_DMA_Priority DMA_PRIORITY(RTE_UART4_RX_DMA_PRIORITY)

    #define UART4_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART4_RX_DMA_NUMBER, RTE_UART4_RX_DMA_STREAM)
  #endif
  #if (RTE_UART4_TX_DMA == 1)
    #define MX_UART4_TX_DMA_Instance DMAx_STREAMy(RTE_UART4_TX_DMA_NUMBER, RTE_UART4_TX_DMA_STREAM)
    #define MX_UART4_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART4_TX_DMA_NUMBER, RTE_UART4_TX_DMA_STREAM)
    #define MX_UART4_TX_DMA_Channel  DMA_CHANNEL_x(RTE_UART4_TX_DMA_CHANNEL)
    #define MX_UART4_TX_DMA_Priority DMA_PRIORITY(RTE_UART4_TX_DMA_PRIORITY)

    #define UART4_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART4_TX_DMA_NUMBER, RTE_UART4_TX_DMA_STREAM)
  #endif

  #ifndef UART4_GPIO_SPEED_FREQ
    #define UART4_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_UART4_TX == 1)
    #define MX_UART4_TX_Pin        1
    #define MX_UART4_TX_GPIOx      RTE_UART4_TX_PORT
    #define MX_UART4_TX_GPIO_Pin   (1U << RTE_UART4_TX_BIT)
    #define MX_UART4_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART4_TX_GPIO_Speed UART4_GPIO_SPEED_FREQ
    #define MX_UART4_TX_GPIO_AF    GPIO_AF8_UART4
  #endif

