xiao6hu/test01/USB_MIDI_UC_OS2_20191123/2.9.0/CMSIS/Driver/USART_STM32F2xx.h
  #if (RTE_UART4_RX == 1)
    #define MX_UART4_RX_Pin        1
    #define MX_UART4_RX_GPIOx      RTE_UART4_RX_PORT
    #define MX_UART4_RX_GPIO_Pin   (1U << RTE_UART4_RX_BIT)
    #define MX_UART4_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART4_RX_GPIO_Speed UART4_GPIO_SPEED_FREQ
    #define MX_UART4_RX_GPIO_AF    GPIO_AF8_UART4
  #endif
#endif

// UART5 configuration definitions
#if (RTE_UART5 == 1)

  #ifndef UART5
    #error "UART5 not available for selected device!"
  #endif

  #define MX_UART5

  #if (RTE_UART5_RX_DMA == 1)
    #define MX_UART5_RX_DMA_Instance DMAx_STREAMy(RTE_UART5_RX_DMA_NUMBER, RTE_UART5_RX_DMA_STREAM)
    #define MX_UART5_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART5_RX_DMA_NUMBER, RTE_UART5_RX_DMA_STREAM)
    #define MX_UART5_RX_DMA_Channel  DMA_CHANNEL_x(RTE_UART5_RX_DMA_CHANNEL)
    #define MX_UART5_RX_DMA_Priority DMA_PRIORITY(RTE_UART5_RX_DMA_PRIORITY)

    #define UART5_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART5_RX_DMA_NUMBER, RTE_UART5_RX_DMA_STREAM)
  #endif
  #if (RTE_UART5_TX_DMA == 1)
    #define MX_UART5_TX_DMA_Instance DMAx_STREAMy(RTE_UART5_TX_DMA_NUMBER, RTE_UART5_TX_DMA_STREAM)
    #define MX_UART5_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART5_TX_DMA_NUMBER, RTE_UART5_TX_DMA_STREAM)
    #define MX_UART5_TX_DMA_Channel  DMA_CHANNEL_x(RTE_UART5_TX_DMA_CHANNEL)
    #define MX_UART5_TX_DMA_Priority DMA_PRIORITY(RTE_UART5_TX_DMA_PRIORITY)

    #define UART5_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART5_TX_DMA_NUMBER, RTE_UART5_TX_DMA_STREAM)
  #endif

  #ifndef UART5_GPIO_SPEED_FREQ
    #define UART5_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_UART5_TX == 1)
    #define MX_UART5_TX_Pin        1
    #define MX_UART5_TX_GPIOx      RTE_UART5_TX_PORT
    #define MX_UART5_TX_GPIO_Pin   (1U << RTE_UART5_TX_BIT)
    #define MX_UART5_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART5_TX_GPIO_Speed UART5_GPIO_SPEED_FREQ
    #define MX_UART5_TX_GPIO_AF    GPIO_AF8_UART5
  #endif

  #if (RTE_UART5_RX == 1)
    #define MX_UART5_RX_Pin        1
    #define MX_UART5_RX_GPIOx      RTE_UART5_RX_PORT
    #define MX_UART5_RX_GPIO_Pin   (1U << RTE_UART5_RX_BIT)
    #define MX_UART5_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART5_RX_GPIO_Speed UART5_GPIO_SPEED_FREQ
    #define MX_UART5_RX_GPIO_AF    GPIO_AF8_UART5
  #endif
#endif

// USART6 configuration definitions
#if (RTE_USART6 == 1)
  #define MX_USART6

  #ifndef USART6
    #error "USART6 not available for selected device!"
  #endif

  #if (RTE_USART6_RX_DMA == 1)
    #define MX_USART6_RX_DMA_Instance DMAx_STREAMy(RTE_USART6_RX_DMA_NUMBER, RTE_USART6_RX_DMA_STREAM)
    #define MX_USART6_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART6_RX_DMA_NUMBER, RTE_USART6_RX_DMA_STREAM)
    #define MX_USART6_RX_DMA_Channel  DMA_CHANNEL_x(RTE_USART6_RX_DMA_CHANNEL)
    #define MX_USART6_RX_DMA_Priority DMA_PRIORITY(RTE_USART6_RX_DMA_PRIORITY)

    #define USART6_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART6_RX_DMA_NUMBER, RTE_USART6_RX_DMA_STREAM)
  #endif
  #if (RTE_USART6_TX_DMA == 1)
    #define MX_USART6_TX_DMA_Instance DMAx_STREAMy(RTE_USART6_TX_DMA_NUMBER, RTE_USART6_TX_DMA_STREAM)
    #define MX_USART6_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART6_TX_DMA_NUMBER, RTE_USART6_TX_DMA_STREAM)
    #define MX_USART6_TX_DMA_Channel  DMA_CHANNEL_x(RTE_USART6_TX_DMA_CHANNEL)
    #define MX_USART6_TX_DMA_Priority DMA_PRIORITY(RTE_USART6_TX_DMA_PRIORITY)

    #define USART6_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART6_TX_DMA_NUMBER, RTE_USART6_TX_DMA_STREAM)
  #endif

  #ifndef USART6_GPIO_SPEED_FREQ
    #define USART6_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_USART6_TX == 1)
    #define MX_USART6_TX_Pin        1
    #define MX_USART6_TX_GPIOx      RTE_USART6_TX_PORT
    #define MX_USART6_TX_GPIO_Pin   (1U << RTE_USART6_TX_BIT)
    #define MX_USART6_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART6_TX_GPIO_Speed USART6_GPIO_SPEED_FREQ
    #define MX_USART6_TX_GPIO_AF    GPIO_AF8_USART6
  #endif

  #if (RTE_USART6_RX == 1)
    #define MX_USART6_RX_Pin        1
    #define MX_USART6_RX_GPIOx      RTE_USART6_RX_PORT
    #define MX_USART6_RX_GPIO_Pin   (1U << RTE_USART6_RX_BIT)
    #define MX_USART6_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART6_RX_GPIO_Speed USART6_GPIO_SPEED_FREQ
    #define MX_USART6_RX_GPIO_AF    GPIO_AF8_USART6
  #endif

  #if (RTE_USART6_CK == 1)
    #define MX_USART6_CK_Pin        1
    #define MX_USART6_CK_GPIOx      RTE_USART6_CK_PORT
    #define MX_USART6_CK_GPIO_Pin   (1U << RTE_USART6_CK_BIT)
    #define MX_USART6_CK_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART6_CK_GPIO_Speed USART6_GPIO_SPEED_FREQ
    #define MX_USART6_CK_GPIO_AF    GPIO_AF8_USART6
  #endif

  #if (RTE_USART6_RTS == 1)
    #define MX_USART6_RTS_Pin        1
    #define MX_USART6_RTS_GPIOx      RTE_USART6_RTS_PORT
    #define MX_USART6_RTS_GPIO_Pin   (1U << RTE_USART6_RTS_BIT)
    #define MX_USART6_RTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART6_RTS_GPIO_Speed USART6_GPIO_SPEED_FREQ
    #define MX_USART6_RTS_GPIO_AF    GPIO_AF8_USART6
  #endif

  #if (RTE_USART6_CTS == 1)
    #define MX_USART6_CTS_Pin        1
    #define MX_USART6_CTS_GPIOx      RTE_USART6_CTS_PORT
    #define MX_USART6_CTS_GPIO_Pin   (1U << RTE_USART6_CTS_BIT)
    #define MX_USART6_CTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART6_CTS_GPIO_Speed USART6_GPIO_SPEED_FREQ
    #define MX_USART6_CTS_GPIO_AF    GPIO_AF8_USART6
  #endif
#endif
#endif /* RTE_DEVICE_FRAMEWORK_CLASSIC */

#if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
  #if ((defined(RTE_Drivers_USART1) || \
        defined(RTE_Drivers_USART2) || \
        defined(RTE_Drivers_USART3) || \
        defined(RTE_Drivers_UART4 ) || \
        defined(RTE_Drivers_UART5 ) || \
        defined(RTE_Drivers_USART6))   \
        && (!defined (MX_USART1))      \
        && (!defined (MX_USART2))      \
        && (!defined (MX_USART3))      \
        && (!defined (MX_UART4 ))      \
        && (!defined (MX_UART5 ))      \
        && (!defined (MX_USART6)))
    #error "USART not configured in STM32CubeMX!"
  #endif

